OpenFOAM/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     icoFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;

endTime         1;
deltaT          0.001;

writeControl    timeStep;
writeInterval   100;
purgeWrite      0;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;
adjustTimeStep  no;
