OpenFOAM/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    wing_naca_0012.stl
    {
        type triSurfaceMesh;
        file "wing_naca_0012.stl";
    }
}


castellatedMeshControls
{
    maxLocalCells        100000;
    maxGlobalCells       2000000;
    mergeTolerance       1e-6;
    minRefinementCells   10;
    nCellsBetweenLevels  1;
    features
    (
    );

    refinementSurfaces
    {
        wing_naca_0012.stl
        {
            level           (2 2);
        }
    }

    resolveFeatureAngle  30;
    locationInMesh      (0.5 0 0.05);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch         3;
    tolerance            2.0;
    nSolveIter           30;
    nRelaxIter           5;
}

addLayersControls
{
    relativeSizes true;

    layers
    {
    }

    expansionRatio      1.0;
    finalLayerThickness 0.3;
    minThickness        0.1;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-30;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    nSmoothScale         4;
    errorReduction       0.75;
}

mergeTolerance 1e-6;

debug 0;
