OpenFOAM/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       113800;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       114000;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2000;
        startFace       114200;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2000;
        startFace       116200;
    }
    front
    {
        type            patch;
        nFaces          4000;
        startFace       118200;
    }
    back
    {
        type            patch;
        nFaces          4000;
        startFace       122200;
    }
)

// ************************************************************************* //
